[{
    "id": 1,
    "review": "Moments that touch the heart are <strong>few</strong> and <strong>far</strong> between in this almost-culmination of a decade of Marvel Comics movies. ",
    "source_url": "https://www.wsj.com/articles/review-avengers-gets-an-incomplete-1524674743"
},{
    "id": 2,
    "review": "Avengers: Infinity War delivers an exciting culmination of the MCU, though it's overstuffed and suffers from certain typical Marvel movie problems.",
    "source_url": "https://screenrant.com/avengers-infinity-war-movie-reviews/"
},
{
    "id": 3,
    "review": "?Avengers: Infinity War? takes you places that most superhero movies don?t ? and where you may not want to go.",
    "source_url": "https://www.washingtonpost.com/goingoutguide/movies/avengers-infinity-war-is-stunningly-dark-but-its-still-wildly-entertaining/2018/04/24/6de7aefc-4291-11e8-ad8f-27a8c409298b_story.html"
},
{
    "id": 4,
    "review": "There were six singularities before the universe existed. When the universe was formed, the Cosmic Entities like Death and Eternity, turned those singularities into concentrated objects of power called Infinity Stones. There are 6 Infinity Stones or Gems in total: Space Stone, Reality Stone, Power Stone, Mind Stone, Time Stone, and finally Soul Stone",
    "source_url": "https://indianexpress.com/article/entertainment/hollywood/avengers-infinity-war-infinity-stones-5147973/"
},
{
    "id": 5,
    "review": "I hate to once again compare the DCEU to Marvel (that's a lie, it's tons of fun), but Marvel takes something that DC has been desperately trying to do and does it 100 times better. The movie is often dark and depressing, but unlike the likes of BvS it is never pessimistic or hopeless. DC has been trying to deliver an edge by dulling their colors and trudging their characters through the muck from the get go, while Marvel realizes that loss and anger and fear are all the more powerful when there is hope and happiness and bravery to go alongside it.",
    "source_url": "https://www.destructoid.com/review-avengers-infinity-war-500208.phtml"
},
{
    "id": 6,
    "review": "Directed by the Russo brothers, the architects behind Cptain Amrica: Civil War and Cptain Amrica: Winter Soldier, Infinity War slyly betrays Cap, presenting his and the Avengers’ worldviews as naive and privileged. Instead, it dares to ask what happens if saving the day means taking real, tangible losses — a concept so foreign that it comes in the form of an intergalactic purple titan named Thanos",
    "source_url": "https://www.vox.com/culture/2018/4/24/17273954/avengers-infinity-war-review"
}]
